<style scoped lang="scss">
  .HelpPage {
    padding: 24px;

    .help-wrapper {
      background-color: white;
      padding: 30px 220px 30px 60px;
    }
  }
</style>

<template>
  <div class="HelpPage">
    <a-affix :style="{ position: 'fixed', top: '120px', right: '70px'}">
      <a-anchor :target-offset="targetOffset">
        <a-anchor-link href="#anchor1" title="人员录入与管理"/>
        <a-anchor-link href="#anchor2" title="项目录入与管理"/>
        <a-anchor-link href="#anchor3" title="发票现金回款录入管理"/>
        <a-anchor-link href="#anchor4" title="项目审批管理"/>
        <a-anchor-link href="#anchor5" title="任务分配与备忘录"/>
        <a-anchor-link href="#anchor6" title="数据导出"/>
        <a-anchor-link href="#anchor7" title="系统参数配置"/>
      </a-anchor>
    </a-affix>
    <div class="help-wrapper">
      <div id="anchor1">
        <h1>一、人员录入与管理</h1>
        <h2>● 使用<b>管理员</b>账号登入系统</h2>
        <h2>● 选择左侧功能栏中的<b>数据管理</b>中的<b>职员管理</b></h2>
        <h2>● 点击列表上方的<b>新增</b></h2>
        <h2>● 输入职员基本信息后提交表单</h2>
        <h2>● 选择左侧功能栏中的<b>用户管理</b></h2>
        <h2>● 点击列表上方的新增</h2>
        <h2>● 输入用户基本信息，其中<b>职员名称</b>一栏中选择<b>对应的职员</b></h2>
        <h2>● 人员录入完成</h2>
        <h2>● 选择左侧功能栏中的<b>数据管理</b>的<b>职员管理</b>即可对现有成员数据进行管理</h2>
      </div>
      <a-divider/>
      <div id="anchor2">
        <h1>二、项目录入与管理</h1>
        <h2>● 使用<b>普通用户</b>账户或者管理员账户登入系统</h2>
        <h2>● 选择左侧功能栏中的<b>数据管理</b>中的<b>合同管理</b></h2>
        <h2>● 点击列表上方的<b>新增</b></h2>
        <h2>● 手动输入合同信息或通过excel表格添加合同(点击或拖拽excel文件导入)</h2>
        <h2>● 情况1：如果是<b>管理员</b>添加合同，可在初始或后续在合同管理页面添加对应管理人员</h2>
        <h2>● 情况2：如果是<b>普通用户</b>(商务专员)添加合同，在添加合同时在<b>商务专员</b>一栏<b>添加自己的信息</b></h2>
        <h2>● 项目录入完成在<b>功能栏左侧</b>的<b>项目列表</b>中查看</h2>
        <h2>● 列表最右侧的<b>项目操作</b>，点击查看可浏览项目状况，点开项目详情后，点击<b>合同总额</b>可查看该项目中的所有合同，点击展开的<b>合同(带下划线）</b>可打开上传的PDF文档</h2>
        <h2>● 点击<b>累计开票</b>与<b>累计收费</b>可展开合同的发票详情与现金详情</h2>
        <h2>● 点击项目生产中的<b>专业/专项</b>项可展开<b>分包合同信息</b></h2>
        <h2>● 列表最右侧的<b>管理</b>操作，可直接进入<b>合同管理</b>界面对合同信息进行修改</h2>
      </div>
      <a-divider/>
      <div id="anchor3">
        <h1>三、发票与现金回款录入管理</h1>
        <h2>● 使用普通用户登入系统</h2>
        <h2>● 方法1：选择左侧功能栏中的<b>数据管理</b>中的<b>合同现金管理</b>或<b>合同发票管理</b></h2>
        <h2>● <b>搜索合同号</b>或者<b>合同名称</b>进入对应列表</h2>
        <h2>● 方法2：如果该合同下<b>已经有</b>对应发票现金数据，选择左侧功能栏中的<b>现金发票</b>列表，搜索对应合同号，点击列表最右侧<b>管理</b>按钮进入管理界面</h2>
        <h2>● 进入管理界面后，选择最上方<b>一键导入</b>可通过excel文件直接导入，或点击下方<b>新增</b>按钮手动输入现金发票信息</h2>
        <h2>● 现金发票信息添加完成，可点击<b>左侧现金发票</b>查看</h2>
        <h2>● 管理方法与添加方法<b>类似</b></h2>
      </div>
      <a-divider/>
      <div id="anchor4">
        <h1>四、项目审批管理</h1>
        <h2>● 使用普通用户登入系统</h2>
        <h2>● 选择左侧功能栏的<b>审批管理</b>，如果该项目人员未分配齐全则无法开始审批</h2>
        <h2>● 如果登录账户为<b>某项目</b>的<b>项目经理</b>则可以可以发起项目审批</h2>
        <h2>● 审批的流程为<b>项目经理->财务专员与商务专员->项目负责人->部门负责人</b></h2>
        <h2>● 只有上一审批层级审批完成后才会跳转到下一个审批层级</h2>
        <h2>● 上一个审批层级完成审批后，下一个层级的用户会在<b>工作台</b>的<b>未完成待办事项</b>中收到提醒</h2>
      </div>
      <a-divider/>
      <div id="anchor5">
        <h1>五、任务分配与备忘录</h1>
        <h2>● 使用普通用户登入系统</h2>
        <h2>● 选择左侧功能栏的<b>工作台</b>(默认页面)，在<b>任务分配</b>可以分配任务</h2>
        <h2>● 点击<b>添加</b>按钮可以分配新的任务，填入任务信息并选择<b>一位或多为执行人员</b></h2>
        <h2>● 被分配的用户登入系统后可看到被分配的任务，也可在<b>筛选</b>按钮中选择自己创建的任务</h2>
        <h2>● 任务分配者与被分配者可以对任务进行<b>反馈、将任务分配给其他用户、完成任务</b></h2>
        <h2>● 任务分配者可以<b>编辑任务</b>以及<b>删除任务</b></h2>
        <h2>● 用户在工作台中可添加备忘事项，新添加的事项将出现在<b>未完成的待办事项</b>中</h2>
        <h2>● 任务完成后可点击<b>完成</b>按钮，该事项会出现在<b>已完成的待办事项</b>中，用户可点击<b>删除</b>按钮自行删除</h2>
        <a-divider/>
        <div id="anchor6">
          <h1>六、数据导出</h1>
          <h2>● 使用普通用户登入系统</h2>
          <h2>● 选择左侧功能栏的<b>现金发票</b>列表，在<b>每条数据左侧</b>可对数据进行勾选</h2>
          <h2>● 勾选好的数据可以在列表上方的<b>导出</b>按钮处选择<b>选择导出</b>进行导出excel文件</h2>
          <h2>● 选择左侧功能栏的<b>项目导出</b>，操作方法与现金发票导出<b>类似</b>，但是可以自由配置导出的表头参数</h2>
          <h2>● 选择<b>导出按钮右侧</b>的<b>齿轮</b>按钮，可对导出表头进行配置，可以自由选择导出excel中的表头参数</h2>
          <h2>● 选择功能栏的<b>分包列表</b>可对分包合同进行导出</h2>
        </div>
        <a-divider/>
        <div id="anchor7">
          <h1>七、系统参数配置</h1>
          <h2>● 使用管理员账户登入系统</h2>
          <h2>● 选择左侧功能栏的<b>系统管理</b>中的<b>参数配置</b>可自由配置系统参数</h2>
          <h2>● 可以在<b>选择框</b>中选择需要配置的参数</h2>
          <h2>● 选择需要配置的项目后，可对拥有的参数进行<b>修改</b>与<b>删除</b>还可以<b>添加</b>新的参数</h2>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
  export default {
    name: "HelpPage",
    data() {
      return {
        targetOffset: undefined,
      };
    },
    mounted() {
      this.targetOffset = window.innerHeight / 2;
    },
  }
</script>

